
/*
功能：某桔农家共有2520只桔子, 父亲要将它们分给六个儿子，其分法如下：
父亲先将2520只桔子分给六个儿子,然后说：
“老大，把你分到的桔子的八分之一给老二；
老二拿到以后，连同原来的桔子分出七分之一给老三；
老三拿到以后，连同原来的桔子分出六分之一给老四；
老四拿到以后，连同原来的桔子分出五分之一给老五；
老五拿到以后，连同原来的桔子分出四分之一给老六；
老六拿到以后，连同原来的桔子分出三分之一给老大”。
这样分完之后，六个儿子手里的桔子正好一样多。问六个儿子原先分到的桔子各是多少只？

*/


#define _CRT_SECURE_NO_WARNINGS
#include<stdlib.h>
#include<stdio.h>
void main63()
{
	int k = 2520;
	int a[6] = { 0 };

	for (int i = 0; i < 6; i++)
	{
		a[i] = k / 6;
	}
	a[0] = a[0] - a[5] / 2;			//老大接受老六的馈赠后便等于2520/6,故初始化老大的送完老二后的值

	for (int i = 5; i >= 1; i--)
	{
		a[i] = a[i] + a[i] / (7 - i) - a[i - 1] / (8 - i);
	}

	a[0] = a[0] + a[0] / 7;//最后加上送给老二的橘子

	int sum = 0;
	for (int i = 0; i<6; i++)
	{
		printf("%d th brother has %5d\n", i + 1, a[i]);
	}
	system("pause");


}