#include<stdio.h>
#include<stdlib.h>




void main5()
{
	//当“格式控制”中格式符个数少于输出表中的输出项时，多余的输出项不予输出。
	//当“格式符”多于输出项时，结果为不定值。

	printf("%d,%d,%d", 1, 2);
	printf("\n%d,%d,%d,%d,%d",1,2,3);

}




void main4()
{

	//%e 支出四舍五入,默认最多输出7位
	//%g 输出实数的的时候，按照宽度最小输出，默认最多输出6位，去掉无意义的0
	printf("f=%f,e=%e,g=%g", 1000000000.0, 1000000000.0, 1000000000.0);//f=1000000000.000000,e=1.000000e+009,g=1e+009
	printf("\nf=%f,e=%e,g=%g", 12.345678,12.345678,12.345678);//f=12.345678,e=1.234568e+001,g=12.3457
	printf("\nf=%f,e=%e,g=%.9g", 12345678.12345678, 12345678.12345678, 12345678.12345678);//f=12345678.123457,e=1.234568e+007,g=1.23457e+007
	system("pause");

}




void main2()
{

	printf("%e", 100000000.0);//按科学计数法输出 1.000000e+008
	//printf("%e", 100000000);输出数据出错
	printf("\n%e", .0000000001);//小数点左侧是0，可省略 1.000000e-010

	printf("\n%.7e", .0000000001);//小数点后保留7位
	printf("\n%20.7e", .0000000001);//右对齐并限定宽度，宽度大于实际，空格，否则，实际显示
	printf("\n%20.7e", .0000000001);//补0
	printf("\n%-20.7e", .0000000001);//- 左对齐
	printf("\n%-020.7e", .0000000001);//左对齐 -前加0，没作用
	//printf("\n%f", 100000000.0);
	system("pause");

}



//%f在所有平台都适用
void main1() 
{
	printf("%f", 1.234567);//默认小数点后6位
	printf("\n%.10f", 1.234567);
	printf("\n%20.10f", 1.234567);//限定宽度
	printf("\n%020.10f", 1.234567);//限定长度，空位补
	printf("\n%-20.10f", 1.234567);//左对齐
	printf("\n%1.10f", 1.234567);//按照实际长度打印
	system("pause");

}